#include "lib_spu.hpp"

#include <sys/types.h>
//#include <libapi.h>
//#include <libetc.h> // ResetCallBack
#include <stdarg.h> // va_list
#include <stdio.h> // printf
#include "psx_stubs.hpp"

extern "C"
{
    #define REPLACE_LIB
    #ifdef REPLACE_LIB
    #define LIBVAR
    #else
    #define LIBVAR extern
    #endif

    typedef struct tagSpuMalloc SPU_MALLOC;
    typedef struct tagSpuControl SPU_RXX;

    // S_RMP0.OBJ
    LIBVAR u32 _spu_rev_startaddr[] =
    {
        0xFFFE, 0xFB28, 0xFC18,	0xF6F8,
        0xF204,	0xEA44,	0xE128,	0xCFF8,
        0xCFF8,	0xF880,	0,		0
    };

    /*
    // S_RMP1.OBJ
    LIBVAR u32 _spu_rev_workareasize[] =
    {
        0,		1240,	984,	2312,
        3580,	5564,	7896,	12296,
        12296,	1920,	0,		0
    };
    */

    // S_INI.OBJ
    LIBVAR u32 _spu_EVdma = 0;
    LIBVAR u32 _spu_keystat = 0;
    LIBVAR u32 _spu_trans_mode = 0;
    LIBVAR u32 _spu_rev_flag = 0;
    LIBVAR u32 _spu_rev_reserve_wa = 0;
    LIBVAR u32 _spu_rev_offsetaddr = 0;
    LIBVAR SpuReverbAttr _spu_rev_attr;
    LIBVAR u32 _spu_RQvoice = 0;
    LIBVAR u32 _spu_RQmask=0;
    LIBVAR u16 _spu_voice_centerNote[24] =
    {
        0xC000, 0xC000, 0xC000, 0xC000,
        0xC000, 0xC000, 0xC000, 0xC000,
        0xC000, 0xC000, 0xC000, 0xC000,
        0xC000, 0xC000, 0xC000, 0xC000,
        0xC000, 0xC000, 0xC000, 0xC000,
        0xC000, 0xC000, 0xC000, 0xC000
    };
    LIBVAR u32 _spu_env = 0;
    LIBVAR u32 _spu_isCalled=0;

    // ZEROBUF.OBJ
    LIBVAR u8 _spu_zerobuf[1024] = { 0 };

    // S_M.obj
    LIBVAR s32 _spu_AllocBlockNum = 0;
    LIBVAR s32 _spu_AllocLastNum = 0;
    LIBVAR SPU_MALLOC *_spu_memList=NULL;

    // private var
    static int _spu_wck;

    // SPU.obj
    LIBVAR u16 _spu_RQ[10];

    LIBVAR volatile SPU_RXX *_spu_RXX = (volatile SPU_RXX*)0x1F801C00;
    LIBVAR u16 _spu_tsa=0;
    LIBVAR u32 _spu_transMode = 0;
    LIBVAR u32 _spu_addrMode = 0;

    LIBVAR u32 _spu_mem_mode = 2;
    LIBVAR u32 _spu_mem_mode_plus = 3;
    LIBVAR u32 _spu_mem_mode_unit = 8;
    LIBVAR u32 _spu_mem_mode_unitM = 7;
    LIBVAR u32 _spu_inTransfer = 1;

    void (*_spu_transferCallback)() = NULL;
    void (*_spu_IRQCallback)() = NULL;


    LIBVAR volatile u32 *SPUDMA_MADR  = (volatile u32*)0x1F8010C0;
    LIBVAR volatile u32 *SPUDMA_BCR   = (volatile u32*)0x1F8010C4;
    LIBVAR volatile u32 *SPUDMA_CHCR  = (volatile u32*)0x1F8010C8;
    LIBVAR volatile u32 *DPCR         = (volatile u32*)0x1F8010F0;
    LIBVAR volatile u32 *SPUSIZE      = (volatile u32*)0x1F801014;

    void _spu_w(void *data, int size);
    void _spu_ssize();
    void _spu_ssize0();

    typedef struct tagSpuVoiceRegister
    {
        SpuVolume volume;	// 0-2
        u16 pitch;			// 4
        u16 addr;			// 6
        u16 adsr[2];		// 8-A
        u16 volumex;		// C
        u16 loop_addr;		// E
    } SPU_VOICE_REG;	// 16 bytes

    typedef struct tagSpuControl
    {
        SPU_VOICE_REG voice[24];
        SpuVolume main_vol;	// 180
        SpuVolume rev_vol;	// 184
        // bit flags
        u16 key_on[2];		// 188
        u16 key_off[2];		// 18C
        u16 chan_fm[2];		// 190
        u16 noise_mode[2];	// 194
        u16 rev_mode[2];	// 198
        u32 chan_on;		// 19C
        u16 unk;			// 1A0
        u16 rev_work_addr;	// 1A2
        u16 irq_addr;		// 1A4
        u16 trans_addr;		// 1A6
        u16 trans_fifo;		// 1A8
        u16 spucnt;			// 1AA SPUCNT
        u16 data_trans;		// 1AC
        u16 spustat;		// 1AE SPUSTAT
        SpuVolume cd_vol;	// 1B0
        SpuVolume ex_vol;	// 1B4
        SpuVolume main_volx;// 1B8
        SpuVolume unk_vol;	// 1BC

        u16 dAPF1; // Starting at 0x1F801DC0
        u16 dAPF2;
        u16 vIIR;
        u16 vCOMB1;
        u16 vCOMB2;
        u16 vCOMB3;
        u16 vCOMB4;
        u16 vWALL;
        u16 vAPF1;
        u16 vAPF2;
        u16 mLSAME;
        u16 mRSAME;
        u16 mLCOMB1;
        u16 mRCOMB1;
        u16 mLCOMB2;
        u16 mRCOMB2;
        u16 dLSAME;
        u16 dRSAME;
        u16 mLDIFF;
        u16 mRDIFF;
        u16 mLCOMB3;
        u16 mRCOMB3;
        u16 mLCOMB4;
        u16 mRCOMB4;
        u16 dLDIFF;
        u16 dRDIFF;
        u16 mLAPF1;
        u16 mRAPF1;
        u16 mLAPF2;
        u16 mRAPF2;
        u16 vLIN;
        u16 vRIN;
    } SPU_RXX;

    typedef struct tagSpuMalloc
    {
        u32 field_0_addr;
        u32 field_4_size;
    } SPU_MALLOC;

    // Forward declares
    int _SpuIsInAllocateArea_(u32 addr);
    void _SpuInit(int mode);

    int  _spu_init(int flag);
